; domain
(define (domain apiary)
 (:requirements :strips :typing :action-costs)
 (:types bee flower)
 (:predicates
    (at-flower ?car - bee)
    (at-flower-id ?car - bee ?curb - flower)
    (behind-bee ?car ?front-car - bee)
    (bee-clear ?car - bee)
    (flower-clear ?curb - flower)
 )

(:functions (total-cost) - number)

  (:action flit-flower-to-flower
    :parameters (?car - bee ?curbsrc ?curbdest - flower)
    :precondition (and
      (bee-clear ?car)
      (flower-clear ?curbdest)
      (at-flower-id ?car ?curbsrc)
    )
    :effect (and
      (not (flower-clear ?curbdest))
      (flower-clear ?curbsrc)
      (at-flower-id ?car ?curbdest)
      (not (at-flower-id ?car ?curbsrc))
    )
  )

  (:action flit-flower-to-bee
    :parameters (?car - bee ?curbsrc - flower ?cardest - bee)
    :precondition (and
      (bee-clear ?car)
      (bee-clear ?cardest)
      (at-flower-id ?car ?curbsrc)
      (at-flower ?cardest)
    )
    :effect (and
      (not (bee-clear ?cardest))
      (flower-clear ?curbsrc)
      (behind-bee ?car ?cardest)
      (not (at-flower-id ?car ?curbsrc))
      (not (at-flower ?car))
    )
  )

  (:action flit-bee-to-flower
    :parameters (?car - bee ?carsrc - bee ?curbdest - flower)
    :precondition (and
      (bee-clear ?car)
      (flower-clear ?curbdest)
      (behind-bee ?car ?carsrc)
    )
    :effect (and
      (not (flower-clear ?curbdest))
      (bee-clear ?carsrc)
      (at-flower-id ?car ?curbdest)
      (not (behind-bee ?car ?carsrc))
      (at-flower ?car)
    )
  )

  (:action flit-bee-to-bee
    :parameters (?car - bee ?carsrc - bee ?cardest - bee)
    :precondition (and
      (bee-clear ?car)
      (bee-clear ?cardest)
      (behind-bee ?car ?carsrc)
      (at-flower ?cardest)
    )
    :effect (and
      (not (bee-clear ?cardest))
      (bee-clear ?carsrc)
      (behind-bee ?car ?cardest)
      (not (behind-bee ?car ?carsrc))
    )
  )
)

; problem
(define   (problem apiary-p05)
  (:domain apiary)
  (:objects
     bee_0  bee_1  bee_2  bee_3  bee_4 - bee
     flower_0 flower_1 flower_2 flower_3 flower_4 - flower
  )
  (:init
    (= (total-cost) 0)
    (at-flower bee_0)
    (at-flower-id bee_0 flower_0)
    (behind-bee bee_2 bee_0)
    (bee-clear bee_2)
    (at-flower bee_3)
    (at-flower-id bee_3 flower_1)
    (bee-clear bee_3)
    (at-flower bee_1)
    (at-flower-id bee_1 flower_2)
    (bee-clear bee_1)
    (at-flower bee_4)
    (at-flower-id bee_4 flower_3)
    (bee-clear bee_4)
    (flower-clear flower_4)
  )
  (:goal
    (and
      (at-flower-id bee_0 flower_0)
      (at-flower-id bee_1 flower_1)
      (at-flower-id bee_2 flower_2)
      (at-flower-id bee_3 flower_3)
      (at-flower-id bee_4 flower_4)
    )
  )
(:metric minimize (total-cost))
)
; =========== INIT ===========
;  curb_0: car_0 car_2
;  curb_1: car_3
;  curb_2: car_1
;  curb_3: car_4
;  curb_4:
; ========== /INIT ===========

; =========== GOAL ===========
;  curb_0: car_0
;  curb_1: car_1
;  curb_2: car_2
;  curb_3: car_3
;  curb_4: car_4
; =========== /GOAL ===========

; plan
1. (flit-flower-to-flower bee_4 flower_3 flower_4)
   deleted: (flower-clear flower_4) (at-flower-id bee_4 flower_3)
   added: (flower-clear flower_3) (at-flower-id bee_4 flower_4)
   goals met: 2 of 5
2. (flit-flower-to-flower bee_3 flower_1 flower_3)
   deleted: (flower-clear flower_3) (at-flower-id bee_3 flower_1)
   added: (flower-clear flower_1) (at-flower-id bee_3 flower_3)
   goals met: 3 of 5
3. (flit-flower-to-flower bee_1 flower_2 flower_1)
   deleted: (flower-clear flower_1) (at-flower-id bee_1 flower_2)
   added: (flower-clear flower_2) (at-flower-id bee_1 flower_1)
   goals met: 4 of 5
4. (flit-bee-to-flower bee_2 bee_0 flower_2)
   deleted: (flower-clear flower_2) (behind-bee bee_2 bee_0)
   added: (bee-clear bee_0) (at-flower-id bee_2 flower_2) (at-flower bee_2)
   goals met: 5 of 5
